
#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
    
   ЮТТесты.ДобавитьТестовыйНабор("СозданиеДокументовПриходаТоваров").ВТранзакции()
   	.ДобавитьТест("СозданиеПриходТовара1", "", "Позитив")
   	.ДобавитьТест("СозданиеПриходТовара2", "", "Позитив")
   	.ДобавитьТест("СозданиеПриходТовара3", "", "Позитив")
   	.ДобавитьТест("СозданиеРасходТовара1", "", "Позитив")
   	.ДобавитьТест("СозданиеРасходТовара2", "", "Позитив")
   	.ДобавитьТест("СозданиеРасходТовара3", "", "Позитив")
//	.ДобавитьТест("ПроверкаДвижений", "", "Позитив")
//	.УдалениеТестовыхДанных()
	;

КонецПроцедуры

Процедура СозданиеПриходТовара1() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	Мосхлеб = Справочники.Контрагенты.НайтиПоКоду("000000012");  //Мосхлеб ОАО
	Хлеб = Справочники.Товары.НайтиПоКоду("000000029"); //Хлеб
	
	ПриходТовара = ЮТест.Данные().КонструкторОбъекта("Документы.ПриходТовара")
		.ФикцияОбязательныхПолей()
	    .Установить("Поставщик", Мосхлеб) 
	    .ТабличнаяЧасть("Товары")
	      .ДобавитьСтроку()
	        .Установить("Товар", Хлеб) 
	        .Установить("Количество", 10)
	        .Установить("Цена", 50)
			.ФикцияОбязательныхПолей()
	    .Провести(Истина); // Проводим документ и возвращаем объект

	Сообщить("Проведен документ: " + ПриходТовара.Номер);
	
	// 2. Выполнение функции.
	РезультатФункции = ПриходТовара;
	
	// 3. Проверка результата.
	ЮТест.ОжидаетЧто(РезультатФункции)
		.ИмеетТип("ДокументОбъект.ПриходТовара")
		.Свойство("Поставщик").Равно(Мосхлеб)
		.Свойство("Товары").Заполнено()
	  	.Свойство("Товары[0].Количество").Равно(10)
		.Свойство("Проведен").ЭтоИстина()
		.Свойство("Движения.ТоварныеЗапасы").Заполнено()
		.Свойство("Движения.Взаиморасчеты").Заполнено()
		;	
		
КонецПроцедуры 

Процедура СозданиеПриходТовара2() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	Поставщик = Справочники.Контрагенты.НайтиПоКоду("000000011");  //ЭлектроБыт ЗАО
	Товар = Справочники.Товары.НайтиПоКоду("000000040"); //Sony К3456P
	
	ПриходТовара = ЮТест.Данные().КонструкторОбъекта("Документы.ПриходТовара")
		.ФикцияОбязательныхПолей()
	    .Установить("Поставщик", Поставщик) 
	    .ТабличнаяЧасть("Товары")
	      .ДобавитьСтроку()
	        .Установить("Товар", Товар) 
	        .Установить("Количество", 10)
	        .Установить("Цена", 2000)
			.ФикцияОбязательныхПолей()
	    .Провести(Истина); // Проводим документ и возвращаем объект

	Сообщить("Проведен документ: " + ПриходТовара.Номер);
	
	// 2. Выполнение функции.
	РезультатФункции = ПриходТовара;
	
	// 3. Проверка результата.
	ЮТест.ОжидаетЧто(РезультатФункции)
		.ИмеетТип("ДокументОбъект.ПриходТовара")
		.Свойство("Поставщик").Заполнено()
		.Свойство("Склад").Заполнено()
		.Свойство("Товары").Заполнено()
	  	.Свойство("Товары[0].Количество").Больше(0)
	  	.Свойство("Товары[0].Сумма").Больше(0)
		.Свойство("Проведен").ЭтоИстина()
		.Свойство("Движения.ТоварныеЗапасы").Заполнено()
		.Свойство("Движения.Взаиморасчеты").Заполнено()
		;
		
	КонецПроцедуры

Процедура СозданиеПриходТовара3() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	Поставщик = Справочники.Контрагенты.НайтиПоКоду("000000010");  //Корнет ЗАО
	Товар = Справочники.Товары.НайтиПоКоду("000000005"); //Тапочки
	
	ПриходТовара = ЮТест.Данные().КонструкторОбъекта("Документы.ПриходТовара")
		.ФикцияОбязательныхПолей()
	    .Установить("Поставщик", Поставщик) 
	    .ТабличнаяЧасть("Товары")
	      .ДобавитьСтроку()
	        .Установить("Товар", Товар) 
	        .Установить("Количество", 100)
			//.Установить("Цена", 200)
			.ФикцияОбязательныхПолей()
	    .Провести(Истина); // Проводим документ и возвращаем объект

	Сообщить("Проведен документ: " + ПриходТовара.Номер);

	// 2. Выполнение функции.
	РезультатФункции = ПриходТовара;
	ВыборкаДвижений = ЮТЗапросы.ДвиженияДокумента(ПриходТовара.Ссылка, "ТоварныеЗапасы");

	// 3. Проверка результата.
	ЮТест.ОжидаетЧто(РезультатФункции)
		.ИмеетТип("ДокументОбъект.ПриходТовара")
		.Свойство("Поставщик").Заполнено()
		.Свойство("Склад").Заполнено()
		.Свойство("Товары").Заполнено()
	  	.Свойство("Товары[-1].Количество").Больше(0)
	  	.Свойство("Товары[-1].Сумма").Больше(0)
		.Свойство("Проведен").ЭтоИстина()
		.Свойство("Движения.ТоварныеЗапасы").Заполнено()
		.Свойство("Движения.Взаиморасчеты").Заполнено()
		;    
		
КонецПроцедуры

Процедура СозданиеРасходТовара1() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	Мосхлеб = Справочники.Контрагенты.НайтиПоКоду("000000012");  //Мосхлеб ОАО
	Хлеб = Справочники.Товары.НайтиПоКоду("000000029"); //Хлеб
	
	РасходТовара = ЮТест.Данные().КонструкторОбъекта("Документы.РасходТовара")
		.ФикцияОбязательныхПолей()
	    .Установить("Покупатель", Мосхлеб) 
	    .ТабличнаяЧасть("Товары")
	      .ДобавитьСтроку()
	        .Установить("Товар", Хлеб) 
	        .Установить("Количество", 10)
	        .Установить("Цена", 50)
			.ФикцияОбязательныхПолей()
	    .Провести(Истина); // Проводим документ и возвращаем объект

	Сообщить("Проведен документ: " + РасходТовара.Номер);
	
	// 2. Выполнение функции.
	РезультатФункции = РасходТовара;
	
	// 3. Проверка результата.
	ЮТест.ОжидаетЧто(РезультатФункции)
		.ИмеетТип("ДокументОбъект.РасходТовара")
		.Свойство("Покупатель").Равно(Мосхлеб)
		.Свойство("Товары").Заполнено()
	  	.Свойство("Товары[0].Количество").Равно(10)
		.Свойство("Проведен").ЭтоИстина()
		.Свойство("Движения.ТоварныеЗапасы").Заполнено()
		.Свойство("Движения.Взаиморасчеты").Заполнено()
		;
		
КонецПроцедуры 

Процедура СозданиеРасходТовара2() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	Поставщик = Справочники.Контрагенты.НайтиПоКоду("000000011");  //ЭлектроБыт ЗАО
	Товар = Справочники.Товары.НайтиПоКоду("000000040"); //Sony К3456P
	
	РасходТовара = ЮТест.Данные().КонструкторОбъекта("Документы.РасходТовара")
		.ФикцияОбязательныхПолей()
	    .Установить("Покупатель", Поставщик) 
	    .ТабличнаяЧасть("Товары")
	      .ДобавитьСтроку()
	        .Установить("Товар", Товар) 
	        .Установить("Количество", 10)
	        .Установить("Цена", 2000)
			.ФикцияОбязательныхПолей()
	    .Провести(Истина); // Проводим документ и возвращаем объект

	Сообщить("Проведен документ: " + РасходТовара.Номер);
	
	// 2. Выполнение функции.
	РезультатФункции = РасходТовара;
	
	// 3. Проверка результата.
	ЮТест.ОжидаетЧто(РезультатФункции)
		.ИмеетТип("ДокументОбъект.РасходТовара")
		.Свойство("Покупатель").Заполнено()
		.Свойство("Склад").Заполнено()
		.Свойство("Товары").Заполнено()
	  	.Свойство("Товары[0].Количество").Больше(0)
	  	.Свойство("Товары[0].Сумма").Больше(0)
		.Свойство("Проведен").ЭтоИстина()
		.Свойство("Движения.ТоварныеЗапасы").Заполнено()
		.Свойство("Движения.Взаиморасчеты").Заполнено()
		;
		
	КонецПроцедуры

Процедура СозданиеРасходТовара3() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	Поставщик = Справочники.Контрагенты.НайтиПоКоду("000000010");  //Корнет ЗАО
	Товар = Справочники.Товары.НайтиПоКоду("000000005"); //Тапочки
	
	РасходТовара = ЮТест.Данные().КонструкторОбъекта("Документы.РасходТовара")
		.ФикцияОбязательныхПолей()
	    .Установить("Покупатель", Поставщик) 
	    .ТабличнаяЧасть("Товары")
	      .ДобавитьСтроку()
	        .Установить("Товар", Товар) 
	        .Установить("Количество", 100)
			//.Установить("Цена", 200)
			.ФикцияОбязательныхПолей()
	    .Провести(Истина); // Проводим документ и возвращаем объект

	Сообщить("Проведен документ: " + РасходТовара.Номер);

	// 2. Выполнение функции.
	РезультатФункции = РасходТовара;
	ВыборкаДвижений = ЮТЗапросы.ДвиженияДокумента(РасходТовара.Ссылка, "ТоварныеЗапасы");

	// 3. Проверка результата.
	ЮТест.ОжидаетЧто(РезультатФункции)
		.ИмеетТип("ДокументОбъект.РасходТовара")
		.Свойство("Покупатель").Заполнено()
		.Свойство("Склад").Заполнено()
		.Свойство("Товары").Заполнено()
	  	.Свойство("Товары[-1].Количество").Больше(0)
	  	.Свойство("Товары[-1].Сумма").Больше(0)
		.Свойство("Проведен").ЭтоИстина()
		.Свойство("Движения.ТоварныеЗапасы").Заполнено()
		.Свойство("Движения.Взаиморасчеты").Заполнено()
		;    
		
КонецПроцедуры

Процедура ПроверкаДвижений() Экспорт
	
	Данные = Новый Массив;
	Данные.Добавить(Новый Структура("КодПоставщика, КодТовара", "000000010", "000000005")); // Корнет ЗАО, Тапочки
	Данные.Добавить(Новый Структура("КодПоставщика, КодТовара", "000000012", "000000029")); // Мосхлеб ОАО, Хлеб
	Данные.Добавить(Новый Структура("КодПоставщика, КодТовара", "000000011", "000000040")); // ЭлектроБыт ЗАО, Sony К3456P

	// Поиск всех объектов
	Для Каждого Элемент Из Данные Цикл 
		
	    Поставщик = Справочники.Контрагенты.НайтиПоКоду(Элемент.КодПоставщика);
	    Товар = Справочники.Товары.НайтиПоКоду(Элемент.КодТовара);
		
	КонецЦикла;
	
КОнецПроцедуры

#КонецОбласти
